#+STARTUP: overview
#+TITLE: MerrinX Config
#+CREATOR: Merrinx
#+LANGUAGE: en

* Appearance
Using dashboard and doom-theme with modeline.

#+begin_src emacs-lisp
  (use-package dashboard
    :ensure t
    :config
    (setq dashboard-startup-banner 'logo
          dashboard-banner-logo-title "Welcome back Master"
          dashboard-set-file-icons t
          dashboard-center-content t
          dashboard-items '((recents  . 5)
                            (bookmarks . 5)
                            (projects . 5)
                            (agenda . 5))
          initial-buffer-choice (lambda () (get-buffer-create "*dashboard*")))
    :init
    :hook (after-init . dashboard-setup-startup-hook))

  (use-package kaolin-themes
    :config
    (setq kaolin-ocean-alt-bg t)
    (setq kaolin-themes-italic-comments t
          kaolin-themes-hl-line-colored t
          kaolin-themes-git-gutter-solid t)
    (load-theme 'kaolin-ocean t))

  (use-package mood-line
    :ensure t
    :custom-face
    :config
    (mood-line-mode)
    :custom
    (mood-line-gpyph-alist mood-line-glyphs-unicode))

  (set-frame-parameter (selected-frame) 'alpha '(97 . 73))
  (add-to-list 'default-frame-alist '(alpha . (97 . 73)))

  (defun toggle-transparency ()
    (interactive)
    (let ((alpha (frame-parameter nil 'alpha)))
      (set-frame-parameter
       nil 'alpha
       (if (eql (cond ((numberp alpha) alpha)
                      ((numberp (cdr alpha)) (cdr alpha))
                      ((numberp (cadr alpha)) (cadr alpha)))
                100)
           '(97 . 73) '(100 . 100)))))
  (global-set-key (kbd "C-S-s") 'toggle-transparency)

  (use-package all-the-icons
    :ensure t)

  (use-package all-the-icons-dired
    :ensure t
    :hook (dired-mode . all-the-icons-dired-mode))

  (use-package all-the-icons-ivy-rich
    :ensure t
    :init (all-the-icons-ivy-rich-mode 1))

  (use-package nerd-icons
    :ensure t
    :config
    (setq nerd-icons-font-family "Iosevka Nerd Font"))

  (add-hook 'after-make-frame-functions
            (lambda (f)
              (with-selected-frame f
                (set-frame-font "Iosevka Nerd Font 11" nil t)
                (set-face-attribute 'mode-line nil :font "Iosevka Nerd Font 12" :height 100)
                (set-face-attribute 'company-tooltip nil :font "Iosevka Nerd Font 11" :height 100))))

  (add-to-list 'default-frame-alist '(height . 64))
  (add-to-list 'default-frame-alist '(width . 370))

#+end_src

#+RESULTS:
: ((tab-bar-lines . 0) (width . 370) (height . 64) (alpha 91 . 55) (vertical-scroll-bars) (left-fringe . 8) (right-fringe . 8))

